; domain
(define (domain matching-bw-typed)
(:requirements :typing)
(:types block hand)
(:predicates (hand-positive ?h - hand)
             (hand-negative ?h - hand)
             (block-positive ?b - block)
             (block-negative ?b - block)
             (clear ?b - block)
             (on-table ?b - block)
             (empty ?h - hand)
             (holding ?h - hand ?b - block)
             (on ?b1 ?b2 - block)
	     (solid ?b - block)
             (notsolid ?b - block)
)
(:action pickup
  :parameters (?h - hand ?b - block)
  :precondition (and (clear ?b) (on-table ?b) (empty ?h))
  :effect (and (holding ?h ?b) (not (on-table ?b)) (not (clear ?b))
               (not (empty ?h))))
(:action putdown-pos-pos
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-positive ?h) (block-positive ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action putdown-neg-neg
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-negative ?h) (block-negative ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action putdown-pos-neg
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-positive ?h) (block-negative ?b))
  :effect (and (empty ?h) (on-table ?b) (clear ?b) (not (solid ?b))(notsolid ?b)
               (not (holding ?h ?b))))
(:action putdown-neg-pos
  :parameters  (?h - hand ?b - block)
  :precondition (and (holding ?h ?b) (hand-negative ?h) (block-positive ?b))
  :effect (and (empty ?h) (on-table ?b) (not (solid ?b))(notsolid ?b) (clear ?b)
               (not (holding ?h ?b))))
(:action stack-pos-pos
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-positive ?h) (block-positive ?b))
  :effect (and (empty ?h) (on ?b ?underb) (clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-neg-neg
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-negative ?h) (block-negative ?b))
  :effect (and (empty ?h) (on ?b ?underb) (clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-pos-neg
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-positive ?h) (block-negative ?b))
  :effect (and (empty ?h) (on ?b ?underb) (not (solid ?b)) (notsolid ?b)(clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))
(:action stack-neg-pos
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (clear ?underb) (solid ?underb) (holding ?h ?b) (hand-negative ?h) (block-positive ?b))
  :effect (and (empty ?h) (on ?b ?underb) (not (solid ?b)) (notsolid ?b)(clear ?b)
               (not (clear ?underb)) (not (holding ?h ?b))))

(:action unstack
  :parameters  (?h - hand ?b ?underb - block)
  :precondition (and (on ?b ?underb) (clear ?b) (empty ?h))
  :effect (and (holding ?h ?b) (clear ?underb) (not (clear ?b))
               (not (on ?b ?underb)) (not (empty ?h))))
)

; problem
(define (problem matching-bw-typed-n10)
(:domain matching-bw-typed)
(:objects h1 h2 - hand 
b1 b2 b3 b4 b5 b6 b7 b8 b9 b10  - block)
(:INIT 
(block-negative b10) 
(block-negative b6) 
(block-negative b7) 
(block-negative b8) 
(block-negative b9) 
(block-positive b1) 
(block-positive b2) 
(block-positive b3) 
(block-positive b4) 
(block-positive b5) 
(clear b1)
(clear b4)
(clear b9)
(empty h1)
(empty h2)
(hand-negative h2) 
(hand-positive h1) 
(on b1 b3)
(on b2 b6)
(on b3 b8)
(on b5 b10)
(on b6 b7)
(on b8 b5)
(on b9 b2)
(on-table b10)
(on-table b4)
(on-table b7)
(solid b1)
(solid b10)
(solid b2)
(solid b3)
(solid b4)
(solid b5)
(solid b6)
(solid b7)
(solid b8)
(solid b9)
)
(:goal (and

 (on b1 b2)
 (on b3 b1)
 (on b5 b10)
 (on b6 b8)
 (on b9 b7)
 (on b10 b9)))
)

; plan
1. (unstack h2 b9 b2)
   deleted: (clear b9) (on b9 b2) (empty h2)
   added: (holding h2 b9) (clear b2)
   goals met: 1 of 6
2. (unstack h1 b2 b6)
   deleted: (clear b2) (on b2 b6) (empty h1)
   added: (holding h1 b2) (clear b6)
   goals met: 1 of 6
3. (putdown-neg-neg h2 b9)
   deleted: (holding h2 b9)
   added: (empty h2) (on-table b9) (clear b9)
   goals met: 1 of 6
4. (putdown-pos-pos h1 b2)
   deleted: (holding h1 b2)
   added: (empty h1) (on-table b2) (clear b2)
   goals met: 1 of 6
5. (unstack h1 b1 b3)
   deleted: (clear b1) (on b1 b3) (empty h1)
   added: (holding h1 b1) (clear b3)
   goals met: 1 of 6
6. (stack-pos-pos h1 b1 b2)
   deleted: (clear b2) (holding h1 b1)
   added: (empty h1) (on b1 b2) (clear b1)
   goals met: 2 of 6
7. (unstack h1 b3 b8)
   deleted: (clear b3) (on b3 b8) (empty h1)
   added: (holding h1 b3) (clear b8)
   goals met: 2 of 6
8. (unstack h2 b8 b5)
   deleted: (clear b8) (on b8 b5) (empty h2)
   added: (holding h2 b8) (clear b5)
   goals met: 2 of 6
9. (stack-pos-pos h1 b3 b1)
   deleted: (clear b1) (holding h1 b3)
   added: (empty h1) (on b3 b1) (clear b3)
   goals met: 3 of 6
10. (stack-neg-neg h2 b8 b3)
   deleted: (clear b3) (holding h2 b8)
   added: (empty h2) (on b8 b3) (clear b8)
   goals met: 3 of 6
11. (unstack h1 b5 b10)
   deleted: (clear b5) (on b5 b10) (empty h1)
   added: (holding h1 b5) (clear b10)
   goals met: 2 of 6
12. (unstack h2 b6 b7)
   deleted: (clear b6) (on b6 b7) (empty h2)
   added: (holding h2 b6) (clear b7)
   goals met: 2 of 6
13. (stack-neg-neg h2 b6 b8)
   deleted: (clear b8) (holding h2 b6)
   added: (empty h2) (on b6 b8) (clear b6)
   goals met: 3 of 6
14. (pickup h2 b9)
   deleted: (on-table b9) (clear b9) (empty h2)
   added: (holding h2 b9)
   goals met: 3 of 6
15. (stack-neg-neg h2 b9 b7)
   deleted: (clear b7) (holding h2 b9)
   added: (empty h2) (on b9 b7) (clear b9)
   goals met: 4 of 6
16. (pickup h2 b10)
   deleted: (on-table b10) (clear b10) (empty h2)
   added: (holding h2 b10)
   goals met: 4 of 6
17. (stack-neg-neg h2 b10 b9)
   deleted: (clear b9) (holding h2 b10)
   added: (empty h2) (on b10 b9) (clear b10)
   goals met: 5 of 6
18. (stack-pos-pos h1 b5 b10)
   deleted: (clear b10) (holding h1 b5)
   added: (empty h1) (on b5 b10) (clear b5)
   goals met: 6 of 6
